;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL校正軟體
ID1022=方案集
ID1023=請選擇:
ID1007=另存為
ID1017=刪除
ID1084=導入
ID1085=導出

ID1075=校正頭
ID1024=基本參數
ID1025=校正範圍(mm):
ID1026=打標範圍(mm):
ID1072=坐標系
ID1077=旋轉角度
ID1079=X偏移(mm)
ID1080=Y偏移(mm)

ID1030=網格及級別校正
ID1009=添加級別
ID1010=刪除級別
ID1012=多級整體效果
ID1031=回字級數:

ID1053=紅光校正
ID1043=啟用
ID1054=X縮放比:
ID1055=Y縮放比:
ID1056=X偏移量(mm):
ID1057=Y偏移量(mm):

ID1058=調焦
ID1065=聚焦方式
ID1059=動態調焦類型
ID1060=控制模式
ID1061=振鏡軸間距(mm)
ID1082=方頭到工作平面高度(mm)
ID1063=微調值(um)
ID1062=動態調焦補償係數

ID1011=測試 F7
ID1037=停止
ID1014=參數>>

ID1109=校正類型
ID1099=普通校正
ID1100=高精度校正1[掃描器]
ID1101=高精度校正2[二次元，適合大範圍]
ID1110=高精度校正說明：1、首先選擇普通校正進行常規的校正，對坐標系、紅光校正、BOX大小及變形進行初步調整。2、選擇高精度校正1或高精度校正2，生成網格點。3、用不同的工具獲得資料並進行處理後，將資料導入，對BOX大小及變形進行精確調整及試打。
ID1114=直接導入高精度校正數據

ID1089=高精度校正
ID1086=生成網格點
ID1111=第一步:生成網格點。
ID1112=第二步:用掃描器或二次元獲取資料，通過專用工具對資料進行處理。
ID1113=第三步:導入處理後的資料，設置縮放凹凸係數，創建高精度校正表。

ID1096=縮放
ID1027=有效打標範圍(mm)
ID1097=凹凸
ID1028=測試BOX大小(mm):
ID1091=導入掃描器處理後資料
ID1087=導入二次元處理後資料
ID1016=創建高精度校正表

ID1=確定
ID2=取消

[CALISET_DLG_167]
CAPTION=高精度資料導入
ID1114=二次元獲取的X座標文件：
ID1115=二次元獲取的Y座標文件：
ID1=確定
ID2=取消

[CALISET_DLG_159]
CAPTION=保存方案
ID1036=校正方案另存為:
ID1=確定
ID2=取消

[CALISET_DLG_131]
CAPTION=打標參數
ID1032=打標次數:
ID1033=打標速度(mm/s)
ID1035=功率(%)
ID1034=Q頻(KHz)
ID1036=Q釋放時間(us)
ID1037=鐳射關延時(us)
ID1=確定
ID2=取消

[CALISET_DLG_160]
CAPTION=設置點陣打標行列資訊
ID1093=行數
ID1094=列數
ID1116=僅設置行列數,不打標
ID1=打標
ID2=取消

[CALISET_DLG_164]
CAPTION=選擇控制卡
ID1098=請選擇工作卡：
ID1=確定
ID2=取消


[CALISET_STRINGTABLE]
ID0=BOX大小(mm)
ID1=X縮放比例％
ID2=Y縮放比例％
ID3=X凹凸
ID4=Y凹凸
ID5=X梯形
ID6=Y梯形
ID7=X平行
ID8=Y平行
ID9=X正向比例％
ID10=X負向比例％
ID11=Y正向比例％
ID12=Y負向比例％
ID13=參數\級別
ID14=電流(A)
ID15=功率(%)
ID16=電流(%)
ID999=已經有打標軟體或校正軟體正在運行,請先關閉!
ID1000=打標庫檔丟失或損壞，請確認軟體是否正常!
ID1001=打標控制卡初始化失敗!
ID1002=打標控制卡系統設置失敗!
ID1003=請先選擇要測試的校正級別!
ID1004=操作失敗，請稍後再試!
ID1005=已存在該方案名，覆蓋嗎?	
ID1006=校正範圍不能為0!	
ID1007=打標範圍不能為0!
ID1008=校正範圍和打標範圍的比例係數不對，校正範圍必須是打標範圍的%.3f倍上!
ID1011=請選擇要刪除級別
ID1012=請至少保留一級校正!
ID1013=檔錯誤!
ID1014=設定校正資料到卡失敗，請稍後重試!	
ID1015=該校正配置方案與當前軟體版本不一致，是否強制讀入嗎?
ID1016=BOX大小不能超出打標範圍!
ID1017=BOX大小不能超出上一級大小!
ID1018=當前校正設置已經修改，保存嗎?
ID1019=讀取檔失敗!
ID1020=確認刪除當前方案嗎?
ID1021=沒有檢測到軟體狗!
ID1022=檢測到軟體狗，但不是合法的軟體狗!
ID1023=插入的合法軟體狗多於1個!
ID1024=將初始狗轉換成運行狗失敗!
ID1025="當前軟體授權已到期，需要聯繫大族客服人員，重新申請與（狗ID=%s，校驗碼=%s）匹配的許可授權補丁，以便繼續使用"
ID1026="D160"
ID1027="D480"
ID1028="CO2增強"
ID1029="CO2傳統"
ID1030="打標失敗"
ID1031=BOX大小不能小於下一級大小!
ID1032=超出有效校正區域
ID1033="fθ後聚焦"
ID1034="前聚焦"
ID1035="普通後聚焦"
ID1036="簡便雷射器控制模式下BOX大小必須小於打標範圍%dmm"
ID1037="獲取卡內保存的狗ID失敗,請檢查卡是否被綁定過"
ID1038="導入失敗"
ID1039="導入成功"
ID1040="導出失敗"
ID1041="導出成功"
ID1042="操作失敗"
ID1043="檔資料不匹配"
ID1044="SCAN_254"

;---------------------------------End: EMCC\Caliset-----------------------------------------

;---------------------------------BEGIN: EMCC\ADJUSTM-----------------------------------------
[ADJUSTM_STRINGTABLE]
ID1000=目前你選擇了CLASSIC控制模式，M值無需再作調試！
ID1001=打標速度(mm/s)
ID1002=空跳速度(mm/s)
ID1003=Q頻(KHZ)
ID1004=Q釋放(ms)
ID1005=占空比(%)
ID1006=電流(A)
ID1007=功率(%)
ID1008=電流(%)
ID1009=鐳射模式/波形
ID1010=維持電流(%)

[ADJUSTM_DLG_129]
ID1027 = 第一步：校正方框圖形
ID1030 = 現在將要標記一個4*4mm的方框，請調整M值，使用方框四個角吻合。
ID1031 = 正常:
ID1032 = M值過大:
ID1033 = M值過小:
ID1034 = 打標參數
ID1035 = M值校正
ID1036 = M校正值
ID1037 = 調整係數
ID1004 = 下一步
ID1 = 確定
ID2 = 取消

[ADJUSTM_DLG_133]
ID1028 = 第二步：校正往復填充線
ID1038 = 現在將要以往復打標方式標記五根填充線，在上一次調整的基礎上，微調M值，使其效果更佳。
ID1039 = 效果
ID1031 = 正常
ID1032 = M值過大
ID1033 = M值過小
ID1035 = M值校正
ID1036 = M校正值
ID1037 = 調整係數
ID1004 = 下一步
ID1 = 確定
ID2 = 取消


[ADJUSTM_DLG_137]
ID1029 = 第三步：綜合測試
ID1040 = 現在將對外框和填充線同時標記，檢查打標效果是否理想，如果有必要請再次微調M值.
ID1041 = 效果
ID1031 = 正常
ID1032 = M值過大
ID1033 = M值過小
ID1035 = M值校正
ID1036 = M校正值
ID1037 = 調整係數
ID1 = 完成
ID2 = 取消

;---------------------------------End: EMCC\ADJUSTM-----------------------------------------
